stress-tests/artillery-auth.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Load test with authentication
    - duration: 120
      arrivalRate: 15
      name: "Authenticated load test"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

  processor: "./auth-processor.js"

scenarios:
  # Login and perform authenticated actions
  - name: "Authenticated User Flow"
    weight: 100
    beforeRequest: "setAuthToken"
    flow:
      - post:
          url: "/auth/login"
          json:
            username: "admin"
            password: "admin123"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401, 429]
      - get:
          url: "/users"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 403]
      - get:
          url: "/tournaments"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/match-scores"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 403]
      - get:
          url: "/field-referees"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 403]