stress-tests/artillery-basic.yml
config:
  target: 'http://127.0.0.1:5000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    # Gradual load increase
    - duration: 60
      arrivalRate: 20
      name: "Gradual increase"
    # Peak load
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    # Sustained load
    - duration: 180
      arrivalRate: 30
      name: "Sustained load"
    # Cool down
    - duration: 30
      arrivalRate: 5
      name: "Cool down"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

scenarios:
  # Basic health check and public endpoints
  - name: "Public Endpoints Test"
    weight: 40
    flow:
      - get:
          url: "/api/"  # Add /api prefix
          expect:
            - statusCode: 200
      - get:
          url: "/api/tournaments"  # Add /api prefix
          expect:
            - statusCode: 200
      - get:
          url: "/api/teams"  # Add /api prefix
          expect:
            - statusCode: 200
      - get:
          url: "/api/matches"  # Add /api prefix
          expect:
            - statusCode: 200
      - get:
          url: "/api/stages"  # Add /api prefix
          expect:
            - statusCode: 200

  # Authentication flow test
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/register"  # Add /api prefix
          json:
            username: "testuser_{{ $randomString() }}"
            password: "TestPassword123!"
            email: "test{{ $randomString() }}@example.com"
            firstName: "Test"
            lastName: "User"
            role: "PARTICIPANT"
          expect:
            - statusCode: [201, 400, 409]
      - post:
          url: "/api/auth/login"  # Add /api prefix
          json:
            username: "admin"
            password: "admin123"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401, 429]

  # Mixed load test
  - name: "Mixed Operations"
    weight: 30
    flow:
      - loop:
          - get:
              url: "/api/tournaments"  # Add /api prefix
          - get:
              url: "/api/teams"  # Add /api prefix
          - get:
              url: "/api/matches"  # Add /api prefix
          - get:
              url: "/api/stages"  # Add /api prefix
        count: 3