stress-tests/artillery-performance.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Performance baseline test
    - duration: 60
      arrivalRate: 1
      name: "Single user baseline"
    - duration: 60
      arrivalRate: 5
      name: "Light load"
    - duration: 60
      arrivalRate: 10
      name: "Medium load"
    - duration: 60
      arrivalRate: 20
      name: "Heavy load"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

scenarios:
  # Comprehensive endpoint testing
  - name: "Full API Coverage"
    weight: 100
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: text/html
      - get:
          url: "/tournaments"
          expect:
            - statusCode: 200
            - contentType: json
      - get:
          url: "/teams"
          expect:
            - statusCode: 200
      - get:
          url: "/matches"
          expect:
            - statusCode: 200
      - get:
          url: "/stages"
          expect:
            - statusCode: 200
      - get:
          url: "/users"
          expect:
            - statusCode: [200, 401, 403]
      - get:
          url: "/match-scores"
          expect:
            - statusCode: [200, 401, 403]
      - get:
          url: "/score-config"
          expect:
            - statusCode: [200, 401, 403]
      - get:
          url: "/field-referees"
          expect:
            - statusCode: [200, 401, 403]