stress-tests/artillery-soak.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Soak test - sustained load over time
    - duration: 600  # 10 minutes
      arrivalRate: 25
      name: "Sustained load"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

scenarios:
  # Realistic user behavior simulation
  - name: "Tournament Management Flow"
    weight: 30
    flow:
      - get:
          url: "/tournaments"
      - get:
          url: "/teams"
      - get:
          url: "/matches"
      - get:
          url: "/stages"
      - think: 2  # 2 second pause between requests

  # Match scoring simulation
  - name: "Match Operations"
    weight: 25
    flow:
      - get:
          url: "/matches"
      - get:
          url: "/match-scores"
      - think: 3

  # User management operations
  - name: "User Operations"
    weight: 25
    flow:
      - get:
          url: "/users"
      - think: 2

  # General browsing
  - name: "General Browsing"
    weight: 20
    flow:
      - get:
          url: "/"
      - get:
          url: "/tournaments"
      - think: 1